URL: https://ads-developers.yahoo.co.jp/en/ads-api/announcement/250625.html
Content:
2025/06/25


SEARCH ADS: REMOVAL OF DISCONTINUED AD TYPES AND SOME KEYWORDS


PRODUCT

Yahoo! JAPAN Ads Search Ads


SCHEDULE

July 22 - August 5, 2025
*This date is subject to change.


SUMMARY

To ensure stable system operation and future feature expansion, the following
ads and keywords will be removed.


ADS OF THE FOLLOWING AD TYPES (ALL DISCONTINUED BEFORE 2017 AND HAVE BEEN
INACTIVE FOR OVER FIVE YEARS)

 * Short Ad [12-12]
 * Ads using previous URL format


KEYWORDS THAT FALL UNDER BOTH OF THE FOLLOWING:

 * The review completion date is before December 31, 2017.
 * The review status is "Declined" or "Paused."
   
   

Removal will be done on an account basis.
We cannot answer when the ads and keywords of each account will be removed. We
appreciate your understanding.

After the ads and keywords are removed, review details and added creatives will
no longer appear.
If you need to review the details, consider downloading and saving them before
the implementation.
Refer to the following help pages for steps to download.
Download data from the list view
[https://ads-help.yahoo-net.jp/s/article/H000046037?language=en_US]

Performance results can still be obtained from the performance report even after
removal.

URL: https://ads-developers.yahoo.co.jp/en/ads-api/announcement/250623.html
Content:
2025/06/23


DISPLAY ADS: LAUNCH OF THE TRACKING TAG AND NEW CONVERSION API


PRODUCT

Yahoo! JAPAN Ads Display Ads


SCHEDULE

June 30, 2025
*This date is subject to change.


SUMMARY

We will launch the tracking tag and the new conversion API for Display Ads. At
the time of launch, they will be available only for Display Ads. We plan to make
them available for other services in the future. Wait for further announcements
with detailed schedules.
The current conversion tracking tags, site retargeting tags, and the previous
version of the conversion API are still available. We recommend using the new
tags and API if you are new to using conversion tracking.

■Tracking tag
The tracking tag is designed to measure the performance of various LY
Corporation services. You can measure user behaviors (events) by installing this
tag on your website. You can use the measured event data for conversion tracking
and to store audience lists of website visitors.
You can use event data measured by a single tag for multiple purposes,
simplifying tag management compared to the previous format, which required
separate tags for each purpose. Additionally, you can measure conversions by
specifying event types.

(Note)

 * The following tags previously provided by Yahoo! JAPAN Ads are not included
   in the tracking tag.
   * Site general tag
   * Complementary feature tag of conversion tracking
   * Site retargeting tag
   * Conversion tag
 * You can check the status of various event data sent from the tracking tag in
   the Campaign Management Tool.

■New conversion API
The conversion API is an API designed to measure and optimize ad performance
more accurately. The conversion API is less affected by restrictions from
enhanced browser security and ad blockers, letting you obtain more accurate
tracking data.
You can use the event data measured with the new API not only for conversion
tracking but also for storing audience lists of website visitors. You can obtain
a more accurate measurement of advertising effectiveness by linking new
parameters like "line_uid."


YAHOO! JAPAN ADS DISPLAY ADS API

We plan to support the features in this announcement with Display Ads API v17,
scheduled for release on June 30, 2025.
Changes will be as follows:

■Services

 * AudienceListService
 * ConversionTrackerService

■Changes
<AudienceListService>

 * Add null to the response's retargetingTagId.
 * You will be able to specify or return ruleType=EVENT_TYPE when
   audienceListType=WEBSITE_VISITORS.
 * Remove customAudienceId.
 * In add/set/remove, specifying retargetingTagId will become optional.

<ConversionTrackerService>

 * Add "LY_TAG_CONVERSION" to the conversionTrackerType enum.
 * Add a new field, lyTagConversion, under conversionTracker.

■About v17
See the following announcement for v17.
Yahoo! JAPAN Ads API v17 release
[https://ads-developers.yahoo.co.jp/en/ads-api/announcement/250529.html]


DOCUMENT

Learn more in the following document. (The English document will be available
later.)
Download document [https://yahoo.jp/qkJJNi]

URL: https://ads-developers.yahoo.co.jp/en/ads-api/announcement/20250613.html
Content:
2025/06/13


NOTICE OF REVISION TO "YAHOO! JAPAN ADS API TERMS OF USE"


SERVICES

 * Yahoo! JAPAN Ads API


SCHEDULE

June 30, 2025
*This date is subject to change.


REVISION DETAILS

In accordance with the business ID integration*, the Yahoo! JAPAN Ads API Terms
of Use will be revised as follows to change the definition of business IDs that
can use APIs and applications.

 * Article 1(9)
   * Before revision:
     "Yahoo! JAPAN Business ID" refers to an ID assigned by LY Corporation to
     identify businesses that use business-oriented services provided by LY
     Corporation or its partners.
   * After revision:
     "Business ID" refers to an ID assigned by LY Corporation to identify
     businesses that use business-oriented services provided by LY Corporation
     or its partners.
 * Article 11, Paragraph 1 (3)
   * Before revision:
     If the User has multiple API client IDs, etc., using the API or the
     Application with a business ID other than the Yahoo! JAPAN Business ID
     designated by the User himself/herself and approved by LY Corporation.
   * After revision:
     If the User has multiple license keys, etc. for the API, using the API or
     the Application with a business ID other than the business ID designated by
     the User himself/herself and approved by LY Corporation.


IMPACT OF THE REVISION

This change will not affect customers who use the API.


SUPPLEMENT

 * Please see below for the full terms and conditions.
   https://global-marketing.yahoo-net.jp/guidelines/yahoo_ads_api
   [https://global-marketing.yahoo-net.jp/guidelines/yahoo_ads_api]
 * For information on business ID integration (*), please refer to the following
   page. Further details regarding the integration of business IDs in Yahoo!
   JAPAN Ads will be provided at a later date.
   【重要】「LINEビジネスID」並びに「Yahoo! JAPANビジネスID」の統合について
   [https://www.lycbiz.com/jp/news/20250611/]

URL: https://ads-developers.yahoo.co.jp/en/ads-api/announcement/250619.html
Content:
2025/06/19


DISPLAY ADS (AUCTION): END OF SEARCH KEYWORD TARGETING AND AUTOMATIC MIGRATIONS


PRODUCT

Yahoo! JAPAN Ads Display Ads (Auction)


SUMMARY

We have set a firm date for the end of search keyword targeting, including
automatic migration.


■PROCESS TO CLOSE

Date and details are as follows.
*These dates are subject to change.

 * July 16, 2025 End association of search keyword lists to ad groups. Selecting
   automatic migration will become unavailable. The search keyword list subject
   to automatic migration is fixed.
 * July 22, 2025 Start automatic migration.
 * End of August 2025 After automatic migration is complete, we will close
   search keyword targeting.
 * Spring 2026 End data collection for search keyword targeting from performance
   reports.

Customers who are still using search keyword targeting should consider switching
to audience list targeting as soon as possible. Learn more about migration in
the following help page.
Search keyword list migration feature
[https://ads-help.yahoo-net.jp/s/article/H000053911?language=en_US]


■AUTOMATIC MIGRATION AND ENDING PROCESS

Prior to the end of this service, some search keyword lists with recent delivery
results will be automatically migrated. We will do the end process to search
keyword lists that are not subject to automatic migration.

The automatic migration and end process is as follows. See the document in
"Comments" for more details.

Type Conditions Details Automatic migration ・Has recent delivery results.
・The audience list associated with the ad group is still within the upper limit
after migration. Switch your search keyword list to an "advanced segments" list
and set it again as audience list targeting in the same ad group. Remove the
association of the search keyword list. End process ・Has no recent delivery
results.
・Does have recent delivery results but the number of audience lists in the ad
group or the entire account has exceeded the limit. Remove the association from
the ad group and then turn off the delivery setting for that ad group.

We cannot answer when the automatic migration and ending will be processed for
each account. We appreciate your understanding.


NOTES

 * Once search keyword targeting ends, the search keyword list view will no
   longer appear. Consider downloading it in advance if required.
 * Automatic migration may fail in some circumstances. Delivery settings for ad
   groups that fail automatic migration will be turned off. See the following
   document for details. (available in Japanese)


COMMENTS

Download the following document for details. The document is available in
Japanese. The English version will be ready soon.

Download PDF [https://yahoo.jp/D-hwD9]



IMPACTS ON YAHOO! JAPAN ADS API

Yahoo! JAPAN Ads Display Ads API will make the following changes to all
available versions. This date is subject to change.
*The changes that have been implemented are also listed.

Schedule Products Changes April 10, 2025
*Changed SearchKeywordListService add, set cannot be specified. July 16, 2025
AdGroupTargetService When targetType is SEARCH_TARGET, add, set (association to
ad group), and replace (delete and add) cannot be specified. End of August, 2025
SearchKeywordListService get, remove cannot be specified.
SearchKeywordIdeaService get cannot be specified. AdGroupTargetService
targetTypes[]: SEARCH_TARGET cannot be specified in get.
targetType: SEARCH_TARGET cannot be specified in remove. StatsService
targetTypes[]: SEARCH_TARGET cannot be specified in get.

URL: https://ads-developers.yahoo.co.jp/en/ads-api/announcement/250618.html
Content:
2025/06/18


YAHOO! JAPAN ADS SCRIPT RELEASES NEW RUNTIME


PRODUCTS

 * Yahoo! JAPAN Ads Search Ads
 * Yahoo! JAPAN Ads Display Ads


SCHEDULE

July 2, 2025
*This date is subject to change.


SUMMARY

To improve convenience we will release a new runtime (V202507) for Yahoo! JAPAN
Ads Script.
The latest runtime will automatically update the script you are using. If the
system can't update the script, it sends an email to the Yahoo! JAPAN Business
ID that last approved the current script.
You can select the runtime version on your side, but we recommend using the
latest version.

The main feature improvements in this version are as follows:

 * Search Ads
   * We will support the ad display asset removal feature.
     Learn more in the following announcement.
     Learn more [https://global-marketing.yahoo-net.jp/information/20250529]
   * You can upload offline conversion data for Search Ads from Google
     spreadsheets. Add setDataFromString to the Blob object's method to allow
     conversion of character encoding to Shift_JIS in scripts.
 * Display Ads
   * Adding URL to the audience list "Advanced segments."
     Learn more in the following announcement.
     Learn more [https://global-marketing.yahoo-net.jp/information/20250304]

URL: https://ads-developers.yahoo.co.jp/en/ads-api/announcement/250205.html
Content:
2025/06/19


SEARCH ADS: END OF AUTOBIDDING TYPE "ENHANCED CPC"


UPDATES

June 19, 2025: We have ended the enhanced CPC setup and started the migration to
system-driven bid strategies.
May 27, 2025: We will end the setup for enhanced CPC on June 18. 
The system will change "Enhanced CPC" to manual bidding "Individual CPC" by June
30, 2025, if "Enhanced CPC" remains set.
April 15, 2025: We updated the schedule and detailed information.
February 5, 2025: We announced this information.


PRODUCT

Yahoo! JAPAN Ads Search Ads


TOOLS

 * Campaign Management Tool
 * Campaign Editor
 * Yahoo! JAPAN Ads Search Ads API
 * Yahoo! JAPAN Ads Script


SUMMARY

We will no longer offer the autobidding type "Enhanced CPC." We've been
expanding and improving autobidding types. As a result, the autobidding types
"Maximize conversions" and "Maximize conversion value" are more likely to
perform as well as or better than "Enhanced CPC" in their ad performance. Given
this situation, we have decided to end the enhanced CPC.

We will implement the discontinuation in stages. Refer to the details of each
stage as follows.


END OF ENHANCED CPC SETUP


DATE

June 18, 2025


SUMMARY

We have ended the enhanced CPC setup.
When creating or modifying campaigns, you can't set up enhanced CPC.
For existing campaigns with enhanced CPC, we recommend changing to a different
autobidding type according to your goals. Learn more about Bid strategy setting
in campaigns
[https://ads-help.yahoo-net.jp/s/article/H000044972?language=en_US].
If you leave it to enhanced CPC, the system will change it to manual bidding
"Individual CPC." Refer to the next section, "Migration of bid strategies by
system," for more
information.https://ads-help.yahoo-net.jp/s/article/H000044972?language=en_US


MIGRATION OF BID STRATEGIES BY SYSTEM


DATE

June 18, 2025 to June 30, 2025


SUMMARY

We have started the migration to system-driven bid strategies.
The system will change campaigns set with Enhanced CPC to manual bidding
"Individual CPC" by June 30, 2025.
*The migration will run gradually on an account-by-account basis. We can't
specify when it will apply to your account.

Even after migrating to system-driven bid strategies, you can still change to
other autobidding types. When deciding which bid strategy to select, use the A/B
test. Learn more
[https://ads-help.yahoo-net.jp/s/article/H000053491?language=en_US].


END OF ENHANCED CPC


SCHEDULE

June 30, 2025
*This date is subject to change.


SUMMARY

We will end the offering of enhanced CPC.
Along with the system migration, the enhanced CPC items will be removed from the
report creation view and existing templates. After the items are removed, even
if you create reports for the duration before the migration using existing
templates, you won't be able to confirm the enhanced CPC settings.

We will also remove the following items that have already been discontinued:

 * Target Position in search results
 * Enhanced CPC (previously "Maximize conversions")

If you create a performance report after these items are removed, they will
appear as "Other." We recommend creating reports before the discontinuation to
check performance that includes these items.


YAHOO! JAPAN ADS SEARCH ADS API

The impact on the Yahoo! JAPAN Ads Search Ads API is as follows:

Versions affected

 * All versions of Search Ads API
 * Yahoo! JAPAN Ads Script

Services and changes

<At the end of the enhanced CPC settings>

 * CampaignService/add
   Requests with cpcBiddingScheme>enhancedCpcEnabled=true will return an error.
 * CampaignService/set
   Requests to change cpcBiddingScheme>enhancedCpcEnabled from false to true
   will result in an error.
 * ReportdefinitionService/add, getReportFields
   There will be no impact, such as request errors, due to the end of enhanced
   CPC setup or its discontinuation in the current versions, including Search
   Ads API v17, scheduled for release on June 30, 2025.

<When the bid strategy is migrated by the system>

 * CampaignService/get
   You can check the migration status with cpcBiddingScheme>enhancedCpcEnabled.
   *If false, the migration is complete.

<Upon the discontinuation of enhanced CPC>

Specifying the following items, which are already discontinued, will not result
in errors. However, performance values will return as "0" and will instead be
aggregated and returned under "Other" in BID_STRATEGY_TYPE.

・Target position in search results
・Enhanced CPC (formerly "Maximize Conversions")

■Report Types

・BID_STRATEGY
・CAMPAIGN

■ Bid Strategies

・BID_STRATEGY_TYPE > Target position in search results
・BID_STRATEGY_TYPE > Enhanced CPC (Former: Maximize Conversions)

■Return Example

・Current
Target position in search results: 100
Enhanced CPC (Former: Maximize Conversions): 50
Other: 20

・After Discontinuation
Target position in search results: 0
Enhanced CPC (Former: Maximize Conversions): 0
Other: 170 *aggregated here


COMMENTS

Download the following document for details.

Download document [https://yahoo.jp/vuGznD]

URL: https://ads-developers.yahoo.co.jp/en/ads-api/announcement/250514.html
Content:
2025/06/05


DISPLAY ADS: CHANGES TO APP MEASUREMENT


UPDATES

June 5, 2025: We made improvements related to tracking parameters and data
connection with tracking tools.
May 29, 2025: We updated on the removal of some items in the audience list
creation and editing view.
May 14, 2025: We announced this information.


PRODUCTS

 * Yahoo! JAPAN Ads Display Ads (Auction)
 * Yahoo! JAPAN Ads Display Ads (Guaranteed)


REMOVAL OF SOME ITEMS IN THE AUDIENCE LIST CREATION AND EDITING VIEW

■Date
May 28, 2025

■Summary
We removed the following items from "Rule" in the audience list creation and
editing view for "App users" to simplify the views in the Campaign Management
Tool.

 * Custom label
 * Page type

If there are any audience lists with these items set, change the settings based
on the parameters (such as event types) associated on the advertiser's side by
the scheduled date. Removing the rule items doesn't affect ad delivery for the
app user audience lists.


ENHANCEMENTS IN TRACKING PARAMETERS AND DATA CONNECTION TO TRACKING TOOLS

■Date
June 4, 2025

■Summary
(1) Expansion of tracking parameter usage
The following tracking parameters, previously available only for the "App
promotion" campaign goal, are now available for all campaign goals.

 * {ci}
 * {deviceAppType}

This change allows for more varied tracking across campaigns with goals other
than "App promotion."

<Notes>
When you track conversions for campaigns with goals other than "App promotion,"
specify the link ID created in the Display Ads account in your tracking tools
(Adjust, AppsFlyer, Kochava, Singular). If you don't specify the link ID,
conversion tracking won't work correctly.
Learn more about Connect ad measurement tool and Display Ads account
[https://ads-help.yahoo-net.jp/s/article/H000044237?language=en_US].
https://ads-help.yahoo-net.jp/s/article/H000044237?language=en_US

(2) Data connection to tracking tools through the conversion tracking
complementary feature
If the account's auto-tagging setting is "Set," the "_p_c" parameter is added to
the ad URL and linked as a click identifier to tracking tools(*) associated with
Display Ads. By linking click identifiers that lead to app conversions to
tracking tools, you can expect an increase in conversion tracking rates. *In
AppsFlyer, you can't use the "_p_c" parameter for conversion tracking.


IMPACT ON YAHOO! JAPAN ADS DISPLAY ADS API

■Versions affected
All versions

■Services and changes
When using AudienceListService/add or set, you can't specify LABEL or PAGE_TYPE
for appUserAudienceList.rules[].ruleType.

URL: https://ads-developers.yahoo.co.jp/en/ads-api/announcement/2025061802.html
Content:
2025/06/18


INTEGRATED "BUSINESS ID"


PRODUCTS

Yahoo! JAPAN Ads


TOOL

 * Campaign Management Tool
 * Campaign Editor
 * Yahoo! JAPAN Ads API


SCHEDULE

July 23, 2025
*This date is subject to change.


SUMMARY

LY Corporation will integrate the "Yahoo! JAPAN Business ID" and "LINE Business
ID" we offer through our corporate services and change them to "Business ID."
Announcement in Japanese. [https://www.lycbiz.com/jp/news/20250611/]

As a result of this change, we will gradually shift the IDs used for Yahoo!
JAPAN Ads from "Yahoo! JAPAN Business ID" to the integrated "Business ID."

LY Corporation will offer total business support to companies and stores,
connecting diverse business solutions into a single solution. The integrated
"Business ID" will allow seamless use of various services. Yahoo! JAPAN Ads
plans to end using "Yahoo! JAPAN Business ID" in the future. We encourage you to
integrate into the "Business ID."

For more information on how to integrate, check the Yahoo! JAPAN Ads help page
after the release.

Download the following document to learn more about integrated Business ID of
Yahoo! JAPAN Ads. (English version of this document will be ready soon.)

Download PDF [https://yahoo.jp/pGS3p84]




CHANGES IN YAHOO! JAPAN ADS

Some specifications will change in Yahoo! JAPAN Ads to use the integrated
"Business ID." Changes will be as follows:


CHANGE SIGN-IN METHOD

You will be able to sign in with your integrated "Business ID" in the Campaign
Management Tool and Campaign Editor of Yahoo! JAPAN Ads. Customers using LINE
corporate services such as LINE Ads and LINE Official Accounts will also be able
to sign in to Yahoo! JAPAN Ads using their "LINE Business ID," improving
convenience.
Once you integrate to "Business ID," you will not be able to sign in with a
one-time passcode using Yahoo! JAPAN Business ID. If you have not linked your
Yahoo! JAPAN Business ID to your Yahoo! JAPAN ID and are using a one-time
passcode to sign in, we recommend that you use your LINE Business ID business
account to sign in after the integration.
The one-time passcode sign-in using Yahoo! JAPAN Business ID is scheduled to end
around March 2026.


"TOOL ADMINISTRATOR" AND "TOOL ACCESS" WILL END

Applying "Tool administrator" and "Tool access" for Yahoo! JAPAN Business ID to
Yahoo! JAPAN Ads will end. With the end of "Tool administrator" access, only
users with "Admin access" will be able to add new employees (create new Yahoo!
JAPAN Business IDs).
Note that the account access will continue to apply even after the tool
administrator and tool access ends. The range of operations available for the
account will not change.


CHANGE SPECIFICATION OF ACCOUNT TRANSFERS

Beginning with transfers after August 1, 2025, no changes or cancellations of
access for business IDs of the original company will be made. The system does
not change the access of the transfer account, which may allow unintended users
to view and modify the account. Confirm your access before transferring your
account.
See the following help page for details.
Notes on account transfer - Yahoo! JAPAN Business ID
[https://ads-help.yahoo-net.jp/s/article/H000044501?language=en_US#c02]


CHANGE SPECIFICATIONS OF ACCOUNT INVITATION

When inviting users to your account, you currently specify your Yahoo! JAPAN
Business ID. After the implementation date, you will use their e-mail address to
invite users.

Agency Portal (Japanese version) will be available without sign in
You won't need to sign in to view the agency portal after the implementation
date.

Download the document at the beginning of this announcement for details on
changes.


NOTES

 * You can integrate to "Business ID" even if you don't have a "LINE Business
   ID." A "LINE Business ID" will be issued upon integration.
 * To use Yahoo! JAPAN Ads after the implementation date, an "Yahoo! JAPAN
   business ID" is required. When inviting new users to Yahoo! JAPAN Ads, issue
   a "Yahoo! JAPAN Business ID." Specify the Yahoo! JAPAN Business ID you have
   issued and integrate it into the "Business ID".
 * When applying for Yahoo! JAPAN Ads or Yahoo! JAPAN Ads API, you will need to
   continue using your" Yahoo! JAPAN ID." After your application is complete,
   integrate your "Yahoo! JAPAN Business ID" linked to your "Yahoo! JAPAN ID"
   into your "Business ID."
 * After the implementation date, even if a "Yahoo! JAPAN Business ID" approved
   with the Yahoo! JAPAN Ads API has the link removed from a "Yahoo! JAPAN ID,"
   there will be no authentication error in the ad account. To revoke approval,
   refer to "Revoke an approved application" in the following page.
   Check / Revoke Approved Application
   [https://ads-developers.yahoo.co.jp/en/ads-api/startup-guide/app-check.html]

URL: https://ads-developers.yahoo.co.jp/en/ads-api/announcement/25041502.html
Content:
2025/06/04


DISPLAY ADS: CHANGE IN THE METHOD FOR DETERMINING AD DELIVERY PLATFORMS


UPDATES

June 4, 2025: We have started applying this change.
April 15, 2025: We announced this information.


PRODUCT

Yahoo! JAPAN Ads Display Ads


DATE

Starting June 3, 2025


SUMMARY

We have started changing the platform determination method for ad spaces within
the LINE app and apps provided by LY Corporation. The changes will be applied
gradually. This change aims to improve ad management efficiency by making
platform selection more intuitive and straightforward. 
The changes are as follows:

(Before)
Ad places that appear on in-app browsers: web
Other ad places: app

(After)
All ad places within the app: app
*Ad places that appear on in-app browsers will also be considered as app.


IMPACT OF THIS CHANGE

The impact of this change is as follows:

 * If you have specified "Web" only in the platform for device targeting, ad
   delivery will decrease because fewer ad places will be categorized as "Web"
   within the app. To continue delivering ads to the affected ad places after
   the scheduled date, change the platform to "All platforms (web/app)."
 * If you have specified "App" only in the platform for device targeting, ad
   delivery will increase because more ad places will be categorized as "App"
   within the app.
 * If the platform is specified as "Web," delivery volume will decrease, and if
   specified as "App," delivery volume will increase. This may cause
   fluctuations in platform-specific values in performance reports.
 * If you are using the following tracking parameters, the values may fluctuate.
   {isApp}: The value for "false" will decrease, and the value for "true" will
   increase.
   {deviceAppType}: The value for "web" will decrease, and the value for "app"
   will increase.


COMMENTS

You can check the target apps provided by LYC, in addition to the LINE app,
through the following links:
iOS app
[https://apps.apple.com/jp/developer/yahoo-japan-corporation/id288091005]
Android app
[https://play.google.com/store/apps/dev?id=9059031076674808747&hl=ja]https://play.google.com/store/apps/dev?id=9059031076674808747&hl=ja

URL: https://ads-developers.yahoo.co.jp/en/ads-api/announcement/250612.html
Content:
2025/06/12


DISPLAY ADS (AUCTION): STOP DATA CONNECTIONS OF THE "ADVANCED SEGMENTS" LIST
WITH NO PERFORMANCE


PRODUCT

 * Yahoo! JAPAN Ads Display Ads (Auction)


SCHEDULE

July 9, 2025
*This date is subject to change.


SUMMARY

We will stop the data connection of the following audience lists used for
audience list targeting. This is to improve targeting accuracy.


LIST TYPE

 * Advanced segments


CONDITIONS

Preceding lists that had no performance results (impressions) in the last 100
days.


WHAT HAPPENS

We will stop data connections of the lists that match the condition.
Lists that stop data connection will appear with a triangle icon in the Campaign
Management Tool.


Triangle icon in Campaign Management Tool
[https://s.yimg.jp/images/ads-promo_edit/support/images/ly250611.jpg]



FREQUENCY

After the start date, we will periodically stop data connections for lists that
match the conditions.


NOTES

You can't use lists that stop data connection. When you need a list with the
same contents, copy the list and create a new list.
If the list is applied to an ad group, we recommend that you remove the linkage.


COMMENTS

Learn more about the audience list targeting in the following help page.
Audience list targeting
[https://ads-help.yahoo-net.jp/s/article/H000044292?language=en_US]

